/* automatically generated by rust-bindgen 0.68.1 */

pub const fmi2TypesPlatform: &[u8; 8] = b"default\0";
pub const fmi2True: u32 = 1;
pub const fmi2False: u32 = 0;
pub const fmi2Version: &[u8; 4] = b"2.0\0";
pub type fmi2Component = *mut ::std::os::raw::c_void;
pub type fmi2ComponentEnvironment = *mut ::std::os::raw::c_void;
pub type fmi2FMUstate = *mut ::std::os::raw::c_void;
pub type fmi2ValueReference = ::std::os::raw::c_uint;
pub type fmi2Real = f64;
pub type fmi2Integer = ::std::os::raw::c_int;
pub type fmi2Boolean = ::std::os::raw::c_int;
pub type fmi2Char = ::std::os::raw::c_char;
pub type fmi2String = *const fmi2Char;
pub type fmi2Byte = ::std::os::raw::c_char;
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum fmi2Status {
    fmi2OK = 0,
    fmi2Warning = 1,
    fmi2Discard = 2,
    fmi2Error = 3,
    fmi2Fatal = 4,
    fmi2Pending = 5,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum fmi2Type {
    fmi2ModelExchange = 0,
    fmi2CoSimulation = 1,
}
#[repr(u32)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum fmi2StatusKind {
    fmi2DoStepStatus = 0,
    fmi2PendingStatus = 1,
    fmi2LastSuccessfulTime = 2,
    fmi2Terminated = 3,
}
pub type fmi2CallbackLogger = ::std::option::Option<
    unsafe extern "C" fn(
        componentEnvironment: fmi2ComponentEnvironment,
        instanceName: fmi2String,
        status: fmi2Status,
        category: fmi2String,
        message: fmi2String,
        ...
    ),
>;
pub type fmi2CallbackAllocateMemory = ::std::option::Option<
    unsafe extern "C" fn(nobj: usize, size: usize) -> *mut ::std::os::raw::c_void,
>;
pub type fmi2CallbackFreeMemory =
    ::std::option::Option<unsafe extern "C" fn(obj: *mut ::std::os::raw::c_void)>;
pub type fmi2StepFinished = ::std::option::Option<
    unsafe extern "C" fn(componentEnvironment: fmi2ComponentEnvironment, status: fmi2Status),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmi2CallbackFunctions {
    pub logger: fmi2CallbackLogger,
    pub allocateMemory: fmi2CallbackAllocateMemory,
    pub freeMemory: fmi2CallbackFreeMemory,
    pub stepFinished: fmi2StepFinished,
    pub componentEnvironment: fmi2ComponentEnvironment,
}
#[test]
fn bindgen_test_layout_fmi2CallbackFunctions() {
    const UNINIT: ::std::mem::MaybeUninit<fmi2CallbackFunctions> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fmi2CallbackFunctions>(),
        40usize,
        concat!("Size of: ", stringify!(fmi2CallbackFunctions))
    );
    assert_eq!(
        ::std::mem::align_of::<fmi2CallbackFunctions>(),
        8usize,
        concat!("Alignment of ", stringify!(fmi2CallbackFunctions))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logger) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2CallbackFunctions),
            "::",
            stringify!(logger)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocateMemory) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2CallbackFunctions),
            "::",
            stringify!(allocateMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).freeMemory) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2CallbackFunctions),
            "::",
            stringify!(freeMemory)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stepFinished) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2CallbackFunctions),
            "::",
            stringify!(stepFinished)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).componentEnvironment) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2CallbackFunctions),
            "::",
            stringify!(componentEnvironment)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fmi2EventInfo {
    pub newDiscreteStatesNeeded: fmi2Boolean,
    pub terminateSimulation: fmi2Boolean,
    pub nominalsOfContinuousStatesChanged: fmi2Boolean,
    pub valuesOfContinuousStatesChanged: fmi2Boolean,
    pub nextEventTimeDefined: fmi2Boolean,
    pub nextEventTime: fmi2Real,
}
#[test]
fn bindgen_test_layout_fmi2EventInfo() {
    const UNINIT: ::std::mem::MaybeUninit<fmi2EventInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fmi2EventInfo>(),
        32usize,
        concat!("Size of: ", stringify!(fmi2EventInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<fmi2EventInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(fmi2EventInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).newDiscreteStatesNeeded) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2EventInfo),
            "::",
            stringify!(newDiscreteStatesNeeded)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).terminateSimulation) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2EventInfo),
            "::",
            stringify!(terminateSimulation)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).nominalsOfContinuousStatesChanged) as usize - ptr as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2EventInfo),
            "::",
            stringify!(nominalsOfContinuousStatesChanged)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).valuesOfContinuousStatesChanged) as usize - ptr as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2EventInfo),
            "::",
            stringify!(valuesOfContinuousStatesChanged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nextEventTimeDefined) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2EventInfo),
            "::",
            stringify!(nextEventTimeDefined)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nextEventTime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(fmi2EventInfo),
            "::",
            stringify!(nextEventTime)
        )
    );
}
#[doc = "Types for Common Functions"]
pub type fmi2GetTypesPlatformTYPE =
    ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>;
pub type fmi2GetVersionTYPE =
    ::std::option::Option<unsafe extern "C" fn() -> *const ::std::os::raw::c_char>;
pub type fmi2SetDebugLoggingTYPE = ::std::option::Option<
    unsafe extern "C" fn(
        c: fmi2Component,
        loggingOn: fmi2Boolean,
        nCategories: usize,
        categories: *const fmi2String,
    ) -> fmi2Status,
>;
pub type fmi2InstantiateTYPE = ::std::option::Option<
    unsafe extern "C" fn(
        instanceName: fmi2String,
        fmuType: fmi2Type,
        fmuGUID: fmi2String,
        fmuResourceLocation: fmi2String,
        functions: *const fmi2CallbackFunctions,
        visible: fmi2Boolean,
        loggingOn: fmi2Boolean,
    ) -> fmi2Component,
>;
